Revit 2024 API
BuiltInFailures.WallFailures.VerticalLayerExtensionFailure Property
 Cannot extend layer(s) of the highlighted vertically compound wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId VerticalLayerExtensionFailure { get; }
Visual Basic
Public Shared ReadOnly Property VerticalLayerExtensionFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ VerticalLayerExtensionFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace